app/Controllers/Absensi.php

SELECT `tbl_user`.*, `tbl_attendance`.`scan_time`, `tbl_attendance`.`status`
FROM `tbl_user`
JOIN `tbl_attendance` ON `tbl_user`.`id` = `tbl_attendance`.`id_user`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $dari_tgl = \session('dari_tgl');
        $sampai_tgl = \session('sampai_tgl');

        if (\session('type') == 'Admin') {
            $builder = $db->table('tbl_user');
            $builder->select('tbl_user.*, tbl_attendance.scan_time, tbl_attendance.status');
            $builder->join('tbl_attendance', 'tbl_user.id = tbl_attendance.id_user');

            // Tambahkan filter tanggal jika kedua variabel memiliki nilai
            if ($dari_tgl && $sampai_tgl) {
                $builder->where('tbl_attendance.scan_time >=', $dari_tgl);
                // Tambahkan waktu akhir untuk tanggal sampai_tgl
                $builder->where('tbl_attendance.scan_time <=', $sampai_tgl . ' 23:59:59');
            }

            $data = $builder->get()->getResult();