app/Controllers/Dashboard.php

SELECT *
FROM `tbl_code`
WHERE `id_user` = '2'
AND `created_at` >= '2025-01-08 14:20:26'
INSERT INTO `tbl_code` (`code_uniq`, `created_at`, `id_user`) VALUES ('effd2d11b86b18ef', '2025-01-08 14:21:26', '2')
---
    public function generate($id)
    {
        date_default_timezone_set('Asia/Jakarta');
        $db = \Config\Database::connect();
        $codeBuilder = $db->table('tbl_code');

        // Cari kode unik yang berlaku untuk user saat ini dalam 1 menit terakhir
        $existingCode = $codeBuilder
            ->where('id_user', $id)
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-1 minutes')))
            ->get()
            ->getRowArray();

        if (!$existingCode) {
            // Generate kode unik baru
            $uniqueCode = bin2hex(random_bytes(8)); // 16 karakter kode unik
            $codeBuilder->insert([
                'code_uniq'       => $uniqueCode,
                'created_at' => date('Y-m-d H:i:s'),
                'id_user'    => $id,
            ]);

DELETE FROM `tbl_code`
WHERE `created_at` < '2025-01-08 14:20:00'
AND `id_user` = '2'
SELECT *
FROM `tbl_code`
WHERE `id_user` = '2'
AND `code_uniq` = '756e0e9308efb650'
---
    public function processScan()
    {
        // mengatur default timezone ke indonesia
        date_default_timezone_set('Asia/Jakarta');
        $request = $this->request->getJSON();

        if (isset($request->qr_data)) {
            $qrString = $request->qr_data;
            // Decode JSON dari string
            $decodedData = json_decode($qrString, true);
            $id = $decodedData['id_user'];
            $code_uniq = $decodedData['code_uniq'];

            // Koneksi database dan query builder
            $db = \Config\Database::connect();
            $codeBuilder = $db->table('tbl_code');

            // Hapus kode unik yang sudah kadaluarsa (lebih dari 1 menit)
            $codeBuilder
                ->where('created_at <', date('Y-m-d H:i:s', strtotime('-1 minutes')))
                ->where('id_user', $id)
                ->delete();

            // Cari user berdasarkan ID dan code uniq
            $user = $codeBuilder->getWhere(['id_user' => $id, 'code_uniq' => $code_uniq])->getRowArray();