app/Controllers/Dashboard.php

    public function index()
    {
        $id = \session('id');
        $qrcode = $this->generate($id);
        $db = \Config\Database::connect();
        $attendanceBuilder = $db->table('tbl_attendance');
        $userBuilder = $db->table('tbl_user');

        // Contoh kondisi: hanya hitung data dengan status 'Cuti'
        if (\session('type' == 'Admin')) {
            $totalDataCuti = $attendanceBuilder->where('status', 'Cuti')->countAllResults();
            $totalDataHadir = $attendanceBuilder->where('status', 'Hadir')->countAllResults();
            $totalDataSakit = $attendanceBuilder->where('status', 'Sakit')->countAllResults();
            $totalDatauser = $userBuilder->where('status', 1)->countAllResults();
        } else {
            $totalDataCuti = $attendanceBuilder->where('id_user', $id)->where('status', 'Cuti')->countAllResults();
            $totalDataHadir = $attendanceBuilder->where('id_user', $id)->where('status', 'Hadir')->countAllResults();
            $totalDataSakit = $attendanceBuilder->where('id_user', $id)->where('status', 'Sakit')->countAllResults();
            $totalDatauser = $userBuilder->where('status', 1)->countAllResults();
        }
        $totalDataHadirNow = $attendanceBuilder->where('status', 'Hadir')->where('DATE(scan_time)', date('Y-m-d'))->countAllResults();

        // Dapatkan tanggal hari ini
        $today = date('Y-m-d');

        // Cari user berdasarkan barcode dan scan hari ini
        $user = $attendanceBuilder
            ->where('id_user', $id)
            ->where('DATE(scan_time)', $today)
            ->get()
            ->getRowArray();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `status` = 'Cuti'
SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `status` = 'Hadir'
SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `status` = 'Sakit'
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `status` = 'Hadir'
AND DATE(scan_time) = '2025-01-11'
SELECT *
FROM `tbl_attendance`
WHERE `id_user` = '6'
AND DATE(scan_time) = '2025-01-11'

    public function generate($id)
    {
        date_default_timezone_set('Asia/Jakarta');
        $db = \Config\Database::connect();
        $codeBuilder = $db->table('tbl_code');

        // Cari kode unik yang berlaku untuk user saat ini dalam 1 menit terakhir
        $existingCode = $codeBuilder
            ->where('id_user', $id)
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-1 minutes')))
            ->get()
            ->getRowArray();

        if (!$existingCode) {
            // Generate kode unik baru
            $uniqueCode = bin2hex(random_bytes(8)); // 16 karakter kode unik
            $codeBuilder->insert([
                'code_uniq'       => $uniqueCode,
                'created_at' => date('Y-m-d H:i:s'),
                'id_user'    => $id,
            ]);
---
SELECT *
FROM `tbl_code`
WHERE `id_user` = '6'
AND `created_at` >= '2025-01-11 16:34:43'
INSERT INTO `tbl_code` (`code_uniq`, `created_at`, `id_user`) VALUES ('e12028fe5f72ce92', '2025-01-11 16:35:43', '6')