app/Controllers/Dashboard.php

SELECT *
FROM `tbl_user`
WHERE `id` = '2'
SELECT *
FROM `tbl_user`
WHERE `id` = '5'
SELECT *
FROM `tbl_attendance`
WHERE `id_user` = '2'
AND DATE(scan_time) = '2025-01-06'
---
    public function processScan()
    {
        // mengatur default timezone ke indonesia
        date_default_timezone_set('Asia/Jakarta');
        $request = $this->request->getJSON();

        if (isset($request->qr_data)) {
            $qrString = $request->qr_data;
            // Decode JSON dari string
            $decodedData = json_decode($qrString, true);
            $id = $decodedData['id'];

            // Koneksi database dan query builder
            $db = \Config\Database::connect();
            $userBuilder = $db->table('tbl_user');

            // Cari user berdasarkan ID
            $user = $userBuilder->getWhere(['id' => $id])->getRowArray();

            if ($user) {
                // Cek apakah user sudah hadir di hari ini
                $attendanceBuilder = $db->table('tbl_attendance');
                $today = date('Y-m-d'); // Mengambil tanggal hari ini (format Y-m-d)

                // Pengecekan apakah ada absensi dengan user_id dan tanggal hari ini
                $existingAttendance = $attendanceBuilder->getWhere([
                    'id_user' => $user['id'],
                    'DATE(scan_time)' => $today // Menggunakan DATE() untuk mencocokkan hanya tanggal
                ])->getRowArray();