app/Controllers/Login.php

    public function login()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $this->_validate();

        $session = session();
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $builder->select('tbl_user.*, tbl_type_user.name AS type_name');
        $builder->join('tbl_type_user', 'tbl_user.type = tbl_type_user.id');
        $builder->where('tbl_user.email', $email);
        $builder->where('tbl_user.password', md5($password));
        $builder->where('tbl_user.status', 1);
        $login = $builder->get()->getRow();
---
SELECT `tbl_user`.*, `tbl_type_user`.`name` AS `type_name`
FROM `tbl_user`
JOIN `tbl_type_user` ON `tbl_user`.`type` = `tbl_type_user`.`id`
WHERE `tbl_user`.`email` = 'asepbalon12@gmail.com'
AND `tbl_user`.`password` = '4297f44b13955235245b2497399d7a93'
AND `tbl_user`.`status` = 1

    private function _validate()
    {
        $data = array();
        $data['error_string'] = array();
        $data['inputerror'] = array();
        $data['status'] = TRUE;

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        if ($email == '') {
            $data['inputerror'][] = 'email';
            $data['error_string'][] = 'Email wajib diisi!';
            $data['status'] = FALSE;
        }

        if ($this->request->getVar('password') == '') {
            $data['inputerror'][] = 'password';
            $data['error_string'][] = 'Password wajib diisi!';
            $data['status'] = FALSE;
        }
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $login =  $builder->getWhere(['email' => $email, 'password' => md5($password)])->getRow();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'asepbalon12@gmail.com'
AND `password` = '4297f44b13955235245b2497399d7a93'