app/Controllers/User.php

    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $builder->select('tbl_user.*, tbl_type_user.name AS type_name');
        $builder->join('tbl_type_user', 'tbl_user.type = tbl_type_user.id');
        $data = $builder->get()->getResult();

        $builder_type = $db->table('tbl_type_user');
        $data_type = $builder_type->get()->getResult(); // Mengambil semua data dari tabel tbl_user
---
SELECT `tbl_user`.*, `tbl_type_user`.`name` AS `type_name`
FROM `tbl_user`
JOIN `tbl_type_user` ON `tbl_user`.`type` = `tbl_type_user`.`id`
SELECT *
FROM `tbl_type_user`

    public function getbyid($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbl_user');

        // Mengambil data berdasarkan ID
        $user = $builder->where('id', $id)->get()->getRow();
---
SELECT *
FROM `tbl_user`
WHERE `id` = '5'